"""Склонение слова
Реализовать склонение слова «процент» во фразе «N процентов».
Вывести эту фразу на экран отдельной строкой для каждого из чисел в интервале от 1 до 100:
1 процент
2 процента
3 процента
4 процента
5 процентов
6 процентов
...
100 процентов"""
variants = ['процент', 'процента', 'процентов']

for n in range(1, 101):
    if n % 10 == 1 and n % 100 and n != 11:
        print(n, variants[0])
    elif (n % 10 < 5 and n % 10 > 1) and (n % 100 < 10 or n % 100 >= 20):
        print(n, variants[1])
    else:
        print(n, variants[2])


# my_list = ['процент', 'процента', 'процентов']
# for i in range(1, 101):
#     if i == 1 or i % 10 == 1 and i != 11:
#         print(i, my_list[0])
#     elif i > 20 and i % 10 >= 2 and i % 10 < 5:
#         print(i, my_list[1])
#     elif i % 10 >= 5 and i % 10 <= 10 or i == 100 or i >= 10 and i <= 20:
#         print(i, my_list[2])